

<template>
  <div class="income-container"> 
    <div class="chart" id="chart_left3"></div>  
  </div>
</template>

<script>
export default {
  props:['area'],
  name: "income",
  data() {
    return {
      myChart: null,
      chartDataByArea : {
        'BAYVIEW': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [9732, 4947, 4103, 3024, 2399, 2285, 3150, 5873, 8824, 9056, 9121, 8904, 12090, 10018, 10307, 10846, 11884, 12843, 13018, 11855, 10731, 9974, 11006, 9490]
        },
        'CENTRAL': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [12435, 8287, 6740, 3707, 2600, 2300, 2806, 4297, 6838, 8394, 9520, 9859, 13772, 11058, 11298, 12030, 12354, 13449, 14316, 12592, 11261, 10527, 10891, 10592]
        },
        'INGLESIDE': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [9709, 4757, 4119, 2789, 2021, 1908, 2649, 4725, 7019, 7639, 7585, 7539, 11347, 8065, 8366, 9111, 9914, 11044, 11671, 10455, 10026, 9650, 10124, 8860]
        },
        'MISSION': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [16168, 10800, 8693, 5466, 3822, 3025, 4691, 7122, 10229, 10980, 11694, 12173, 15971, 12775, 13081, 14119, 15611, 16773, 17779, 16291, 15249, 14839, 15886, 15748]
        },
        'NORTHERN': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [14148, 9131, 7637, 5340, 3654, 3225, 4128, 6058, 9265, 9936, 10765, 10691, 15093, 11888, 12403, 13317, 13968, 15429, 17126, 16206, 14502, 14093, 14707, 13725]
        },
        'PARK': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [5108, 3018, 2429, 1765, 1327, 1082, 1693, 3413, 5006, 4962, 5388, 5441, 7937, 5893, 6160, 6957, 7100, 7719, 7747, 6519, 6061, 5666, 5946, 5361]
        },
        'RICHMOND': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [6175, 3040, 2561, 1604, 1149, 1045, 1456, 2471, 4204, 4592, 5237, 5444, 7542, 5626, 5659, 6402, 6265, 6854, 7445, 6253, 5833, 5522, 5617, 4808]
        },
        'SOUTHERN': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [19641, 10975, 9107, 5584, 3935, 3377, 5556, 9168, 14044, 16364, 17435, 17836, 23070, 20607, 20981, 21718, 22795, 24635, 25468, 23267, 20054, 18365, 18787, 17923]
        },
        'TARAVAL': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [8190, 3845, 3398, 2459, 1594, 1310, 1998, 3875, 6197, 6606, 6913, 6808, 10678, 7406, 7823, 8584, 8478, 9275, 9767, 8614, 8402, 8248, 8036, 6957]
        },
        'TENDERLOIN': {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [7629, 4544, 4123, 2842, 2029, 2212, 4295, 5357, 6711, 7111, 7979, 8857, 10055, 10761, 11405, 11498, 11971, 12131, 11408, 9853, 8555, 8655, 9011, 7962]
        }
      },
    }
  },
  mounted() {
    this.getEchartLeft3();
  },
  watch: {
    area(newArea) {
      this.updateBusinessData(newArea);
    },
  },
  methods: {
    updateBusinessData(newArea) {
      const data = this.chartDataByArea[newArea];
      if (data) {
        this.getEchartLeft3(data);
      } else {
        // 如果没有对应的数据，可以显示默认数据或提示
        console.warn(`未找到区域 ${newArea} 的图表数据`);
        this.getEchartLeft3({
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [108935, 63344, 52910, 34580, 24530, 21769, 32422, 52359, 78337, 85640, 91637, 93552, 127555, 104097, 107483, 114582, 120340, 130152, 135745, 121905, 110674, 105539, 110011, 101427]
        });
      }
    },
    getEchartLeft3(data) {
      if (!this.myChart) {
        // 实例化对象
        this.myChart = echarts.init(document.getElementById('chart_left3'));
      }

      if (!data) {
        data = {
          city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
          num: [108935, 63344, 52910, 34580, 24530, 21769, 32422, 52359, 78337, 85640, 91637, 93552, 127555, 104097, 107483, 114582, 120340, 130152, 135745, 121905, 110674, 105539, 110011, 101427]
        };
      }
      // }
      // let myChart = echarts.init(document.getElementById('chart_left3'));
      // let data = {
      //   city: ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
      //   num: [108935, 63344, 52910, 34580, 24530, 21769, 32422, 52359, 78337, 85640, 91637, 93552, 127555, 104097, 107483, 114582, 120340, 130152, 135745, 121905, 110674, 105539, 110011, 101427]
      // };
      let maxDataValue = Math.max(...data.num);
      // 将最大值向上取整到最近的 10000
      let yAxisMax = Math.ceil(maxDataValue / 10000) * 10000;
      let option = {
        tooltip: {
          trigger: 'axis',
          axisPointer: {
            lineStyle: {
              color: {
                type: 'linear',
                x: 0,
                y: 0,
                x2: 0,
                y2: 1,
                colorStops: [{
                  offset: 0,
                  color: 'rgba(255,255,255,0)' // 0% 处的颜色
                }, {
                  offset: 0.5,
                  color: 'rgba(255,255,255,1)' // 100% 处的颜色
                }, {
                  offset: 1,
                  color: 'rgba(255,255,255,0)' // 100% 处的颜色
                }],
                global: false // 缺省为 false
              }
            },
          },
          formatter: (value) => {
            return value[0].name + '点犯罪总数<br>' + value[0].value + '次';
          }
        },
        grid: {
          top: '5%',
          left: '2%',
          right: '2%',
          bottom: '0%',
          containLabel: true
        },
        xAxis: [{
          type: 'category',
          boundaryGap: true,
          axisLine: { //坐标轴轴线相关设置。数学上的x轴
            show: false,
            lineStyle: {
              color: '#092b5d'
            },
          },
          axisLabel: { //坐标轴刻度标签的相关设置
            textStyle: {
              color: '#24c4ff',
              margin: 15,
            },
            formatter: (data) => {
                return data + '';
            }
          },
          axisTick: {
            show: false,
          },
          data: data.city
        }],
        yAxis: [{
          min: 0,
          max: yAxisMax,
          splitLine: {
            show: false,
            lineStyle: {
              color: '#092b5d'
            },
          },
          axisLine: {
            show: false,
            lineStyle: {
              color: "#092b5d"
            }
          },
          axisLabel: {
            show: true,
            textStyle: {
              color: '#24c4ff',
            }
          },
          axisTick: {
            show: false,
          },
        }],
        series: [{
          name: '',
          type: 'line',
          symbol: 'circle', // 默认是空心圆（中间是白色的），改成实心圆
          showAllSymbol: true,
          symbolSize: 8,
          lineStyle: {
            normal: {
              color: '#7c80f4', // 线条颜色
            },
            borderColor: 'rgba(0,0,0,.4)',
          },
          itemStyle: {
            color: "rgba(14,30,73,1)",
            borderColor: "#646ace",
            borderWidth: 2
          },
          label: {
            normal: {
              show: false,
              position: 'top',
              formatter: function(params) {
                let value = params.value;
                let formattedValue = Math.round(value / 10000) + 'w';
                return formattedValue;
              },
              textStyle: {
                color: '#fff',
                align: 'center',
              }
            }
          },
          smooth: true,
          areaStyle: { //区域填充样式
            normal: {
              //线性渐变，前4个参数分别是x0,y0,x2,y2(范围0~1);相当于图形包围盒中的百分比。如果最后一个参数是‘true’，则该四个值是绝对像素位置。
              color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                offset: 0,
                color: "rgba(124, 128, 244,.3)"
              },{
                offset: 1,
                color: "rgba(124, 128, 244, 0)"
              }], false),
              shadowColor: 'rgba(53,142,215, 0.9)', //阴影颜色
              shadowBlur: 20 //shadowBlur设图形阴影的模糊大小。配合shadowColor,shadowOffsetX/Y, 设置图形的阴影效果。
            }
          },
          data: data.num
        }]
      }

      this.myChart.setOption(option, true);
      window.addEventListener('resize', () => {
        this.myChart.resize();
      });
    },
  },
  beforeDestroy() {
    
  }
};
</script>

<style lang="scss" scoped>
.income-container {
  .chart {
    height: 3rem;
  }
}
</style>
